{
    "events": [
       {
            "datetime": "Thursday November 29th, 2012",
            "host": {
                "address": "",
                "name": "Two Bit Circus",
                "mapIframeUrl": "",
                "mapUrl": "",
                "misc": "",
                "url": "twobitcircus.com"
            },
            "speakers": [
            {
                "title": "Sandboxing Untrusted Code in Node.js",
                "name": "Joe Rozner",
                "image": "jrozner.jpg",
                "twitter": "jrozner",
                "github": "jrozner",
                "description": "Running untrusted code is always a difficult problem to deal with. This talk will explore some of the potential problems with result from doing this including: resource starvation, data security, remote code execution, and unintended network access. It will then explore some of the design decisions of Node.JS and show how these can be used to help control provide methods to sandbox code to prevent these types of attacks, ending with an explanation of some of the limitations of this technique and possible other solutions.",
                "video": "",
                "videoimg": ""
            },
            {
                "title": "meteor.js",
                "name": "Philippe Lewicki",
                "image": "philfree.jpg",
                "twitter": "philfree",
                "github": "philfree",
                "description": "Meteor is a pure javascript open source platform based on node.js, mongodb, mustache style template with optional  packages like backbone, underscore, bootstrap, coffee script, less, stylus, d3, query... I will present the key concept like live page update, synchronization, hot code push then demo some application and explain how some of the key concept are implemented.",
                "video": "57173526",
                "videoimg": "video_thumbnail.png"
            }
            ],
                "sponsors": [
                {
                    "name": "Edgecast",
                    "logo": "sponsor-edge-cast.png",
                    "url": "http://edgecast.com"
                },
                {
                    "name": "Two Bit Circus",
                    "logo": "host-two-bit.png",
                    "url": "twobitcircus.com"
                }
            ]
        },
        {
            "datetime": "Thursday October 25th, 2012",
            "host": {
                "address": "",
                "name": "The Hub LA",
                "mapIframeUrl": "",
                "mapUrl": "",
                "misc": "",
                "url": "thehubla.com"
            },
            "speakers": [
            {
                "title": "Top 10 Secret Weapons For Front-End Development",
                "name": "Geoffrey Plitt",
                "image": "GeoffreyPlitt.jpg",
                "twitter": "GeoffreyPlitt",
                "github": "GeoffreyPlitt",
                "description": "Geoffrey Plitt, active standup comedian, former Google engineer, and CTO of comedy discovery engine Laffster.com discusses tips, tricks, and pitfalls his teams have learned while using technologies such as KnockoutJS, HeadJS, CoffeeScript, Slim, SASS, Middleman, various jQuery plugins, and Amazon Web Services. Plus he's funny",
                "video": "52991466",
                "videoimg": "video_thumbnail.png"
            },
            {
                "title": "Wheatley",
                "name": "Giles Bowkett",
                "image": "gilesgoatboy.jpg",
                "twitter": "gilesgoatboy",
                "github": "gilesbowkett",
                "description": "Wheatley was designed to refactor JavaScript semi-automatically. The project's unfinished, because writing code which will refactor your JavaScript for you automatically is just insanely overambitious, but the few refactorings it can do are very cool. Wheatley can also recognize identical code and nearly-identical code. Legacy code is annoying. Imagine how cool it would be if robots would fix your legacy code for you!",
                "video": "52996554",
                "videoimg": "video_thumbnail.png"
            }
            ],
                "sponsors": [
                {
                    "name": "Edgecast",
                    "logo": "sponsor-edge-cast.png",
                    "url": "http://edgecast.com"
                },
                {
                    "name": "The Hub LA",
                    "logo": "host-the-hub.png",
                    "url": "thehubla.com"
                }
            ]
        },
        {
            "datetime": "Tuesday September 25th, 2012",
            "host": {
                "address": "",
                "name": "Cross Campus",
                "mapIframeUrl": "",
                "mapUrl": "",
                "misc": "",
                "url": "crosscamp.us"
            },
            "speakers": [
            {
                "title": "Sentiment Analysis in a Post Grammatical World",
                "name": "Danny Tran, Disney",
                "image": "digidanny.jpg",
                "twitter": "digi_danny",
                "github": "digidanny",
                "description": "How do we determine the sentiment of text in a world where syntax and grammer are thrown out of the window? Utilizing Node and Natural, a NLP (Natural Language Processing) toolkit, we'll go through a few techniques ranging from manual polarity determination to machine learning classification, all the while highlighting the challenges of analyzing text in a \"post-grammatical\" world.",
                "video": "50767532",
                "videoimg": "video_thumbnail.png"
            }
            ],
                "sponsors": [
                {
                    "name": "Edgecast",
                    "logo": "sponsor-edge-cast.png",
                    "url": "http://edgecast.com"
                },
                {
                    "name": "html5 Dev Conf",
                    "logo": "sponsor-html5devconf.png",
                    "url": "http://html5devconf-oct2012-jsla.eventbrite.com"
                }
            ]
        },
        {
            "datetime": "Thursday August 30th, 2012",
            "host": {
                "address": "",
                "name": "Yahoo!, Santa Monica",
                "mapIframeUrl": "",
                "mapUrl": "",
                "misc": "",
                "url": "developer.yahoo.com"
            },
            "speakers": [
            {
                "title": "Jukebox.js - Experiment with Modern Web Technology",
                "name": "Jeff Pelton",
                "image": "comster.jpg",
                "twitter": "comster",
                "github": "",
                "description": "Today in the browser you can decode audio, parse metadata and album art, using Audio API & File API's, preview files on your computer using FileReader and upload them using XHR2 with HTML progress bars for the best user experience, build visualizations using a drawing library like D3.js and more. Jukebox.js is an open source experiment showing what you can do with some of the latest web technologies like file access, audio playback, chat, and real time collaboration. The web app is built with tools including backbone.js, socket.io, aurora.js, dancer.js, and more.  The server is built on house.js, a node.js open source platform as a service to provide RESTful interfaces to authentication, file systems, data and media. We'll take a quick look at the broad strategy for modern web app development, then we'll dive into as many of these great HTML features and open source javascript libraries as we can!",
                "video": "49498364",
                "videoimg": "video_thumbnail.png"
            },
            {
                "title": "Sophisticated Views: How Ember's View Layer Handles the Complex Problems",
                "name": "Peter Wagenet",
                "image": "wagenet.png",
                "twitter": "wagenet",
                "description": "Simplicity is good, but what happens when your problems aren't simple? In this talk, I'll discuss some of the complexities of handling events and DOM rendering that are overlooked in many Javascript frameworks. We'll then see how Ember provides sophisticated solutions to these issues so that you don't have to.",
                "video": "49434697",
                "videoimg": "video_thumbnail.png"
            }
            ],
                "sponsors": [
                {
                    "name": "Edgecast",
                    "logo": "sponsor-edge-cast.png",
                    "url": "http://edgecast.com"
                },
                {
                    "name": "Yahoo!",
                    "logo": "host-yahoo.png",
                    "url": "developer.yahoo.com"
                }
            ]
        },
        {
            "datetime": "Thursday July 26th, 2012",
            "host": {
                "address": "",
                "name": "CityGrid Media, West Hollywood",
                "mapIframeUrl": "",
                "mapUrl": "",
                "misc": "",
                "url": "http://www.citygridmedia.com/"
            },
            "speakers": [
            {
                "title": "JS To Rule Them All",
                "name": "Michael Anthony",
                "image": "activetheory.jpg",
                "twitter": "_activetheory",
                "description": "One of the more cringe-inducing terms for any JS developer is \"web page\". We've now reached the point where any meaningful experience needs to be an application. It also needs to be thoughtfully crafted to work on phones and tablets all the while having the level of animation and polish users have come to expect from the technology they use regardless of platform. Static pages with responsive layouts aren't going to cut it in this new universe, so we'll look at using only JavaScript to structure applications, create and style markup, and also be platform aware in order to present users with an interactive experience suited for each device. This talk will be a general theory overview accompanied by plenty of examples and very brief code demonstrations. It will cover interesting points along the way such as best practices for smooth UI and animation, content management, SEO, and even how to use these exact techniques to create native mobile applications.",
                "video": "47512367",
                "videoimg": "video_thumbnail.png"
            },
            {
                "title": "Backbone.js: The framework that isn't",
                "name": "Daniel Hengeveld",
                "image": "thedaniel.png",
                "twitter": "thedaniel",
                "description": "Backbone.js is often discussed alongside the many other popular client-side frameworks like Ember, Knockout, et cetera. This talk will discuss how Backbone.js is less like those opinionated frameworks and more like a set of glue libraries to build your own framework, and will also cover some useful patterns you can use in your own Backbone application.",
                "video": "47513334",
                "videoimg": "video_thumbnail.png"
            },
            {
                "title": "Going Native: Practical scripting with the JavaScript Image Object",
                "name": "Aaron Martin",
                "image": "aaron-martin.png",
                "twitter": "citygridmedia",
                "description": "JQuery, Dojo, Mootools, Ext, Prototype, Script.aculo.us, Backbone, Modernizer….[sigh]…it’s hard to keep up. Remember when there was just something called JavaScript? I do. Don’t get me wrong I love all the aforementioned libraries like a father loves his children, but when it is time to get practical and create performance solutions those babies got to go. I’m going to introduce you to an old friend of mine, the JavaScript native image object. This ol’boy is perhaps one of the most powerful objects in JavaScript and he’s uber simple to get to know. I’m going to show you some of his tricks and try to convince you that he belongs in your JavaScript solutions tool belt!",
                "video": "47514251",
                "videoimg": "video_thumbnail.png"
            }
            ],
                "sponsors": [
                {
                    "name": "CityGrid",
                    "logo": "citygrid.png",
                    "url": "http://www.citygridmedia.com/"
                }
            ]
        },
        {
            "datetime": "Thursday June 28, 2012 7pm",
            "host": {
                "address": "",
                "name": "Cross Campus",
                "mapIframeUrl": "",
                "mapUrl": "",
                "misc": "",
                "url": "crosscamp.us"
            },
            "speakers": [
            {
                "title": "AngularJS",
                "name": "Igor Minar",
                "image": "igorminar.png",
                "twitter": "IgorMinar",
                "description": "What if you could write modern web apps with dramatically fewer lines of code and improve its readability and expressiveness at the same time? No, there’s no new language to learn. Just familiar old HTML and JavaScript. As a matter of fact, there’s some stuff for you to un-learn. AngularJS is a client-side JavaScript web development framework where we believe we’ve done something special. We’ve approached the problem let’s say differently from the way any other JavaScript tool has before. Instead of asking what kind of functions we could provide to make writing apps smoother, we asked \"what if the browser worked differently in a way that eliminates code and gives structure to apps?\" This talk will take the audience on a tour of what the web platform of the future will look like and how the AngularJS framework can provide many of the powerful capabilities to existing browsers and bridge the path to web components, model driven views and other platform features that are currently being spec-ed.",
                "video": "45624403",
                "videoimg": "video_thumbnail.png"
            },
            {
                "title": "Design to Deploy - Mobile Development with Titanium",
                "name": "Christian Sullivan",
                "image": "euforic.jpg",
                "twitter": "euforic",
                "description": "This talk is about the entire process of creating a mobile application with Titanium. From the early design stage all the way through to the testing and deployment of the app and how to overcome some of the caveats that come with using Titanium.",
                "video": "45558673",
                "videoimg": "video_thumbnail.png"
            },
            {
                "title": "Realtime Visualizations w/ D3 and Backbone",
                "name": "Andrew Cholakian",
                "image": "andrewvc.jpg",
                "twitter": "andrewvc",
                "description": "D3 is perhaps the most powerful tool available for displaying realtime data on the web. By defining its own level of abstraction, being closer to the DOM than charting tools (e.g. highcharts), and being higher level than drawing primitives (e.g. Raphael), you can create amazing data driven visualizations. This talk will cover the basics of D3, and best practices for integrating D3 visualizations with Backbone.js and realtime websocket data.",
                "video": "45558674",
                "videoimg": "video_thumbnail.png"
            }
            ],
                "sponsors": [
                {
                    "name": "Cross Campus",
                    "logo": "crosscampus.png",
                    "url": "crosscamp.us"
                },
                {
                    "name": "Yahoo!",
                    "logo": "sponsor-yahoo.png",
                    "url": "developer.yahoo.com"
                }
            ]
        },
        {
            "datetime": "Thursday May 31, 2012",
            "host": {
                "address": "",
                "name": "ioLA",
                "mapIframeUrl": "",
                "mapUrl": "",
                "misc": "",
                "url": "iola.la"
            },
            "speakers": [
            {
                "title": "Faster JavaScript Through Category Theory",
                "name": "John Bender",
                "image": "johnbender.jpg",
                "twitter": "johnbender",
                "description": "Math, it's certainly not something you expect to see in a presentation about JavaScript, but even this far from its ivory towers it has an important role to play. Together we'll build two categories and see how, by satisfying the category and functor laws, we can optimize our jQuery plugins and methods. Don't worry, you don't need a background in Math just some curiosity and a desire to speed up your jQuery!",
                "video": "44085271",
                "videoimg": "video_thumbnail.png"
            },
            {
                "title": "J3D: Adventures with WebGL",
                "name": "Bartek Drozdz",
                "image": "bartekd.jpg",
                "twitter": "bartekd",
                "description": "I usually find technologies that interest me, experiment with them, publish demos I do and eventually use them in a commercial project. With WebGL it was different - my first contact with this technology was through a client project. I had to learn WebGL on the go. It took me a few months to actually start apperciating it, but once the project was over and I thought I know everything about it, I decided to write my own engine that I baptized simply J3D. After a good start, I realized I didn't know that much about WebGL after all... Since then I spent many day & nights (mostly nights) learning and creating what I believe is a good tool for other developers to start creating 3D applications in the browser. In my presentation I talk about specific challenges when working WebGL projects and how J3D addresses them. I will also take you on a short walk-through of it's features and present some demos.",
                "video": "44073881",
                "videoimg": "video_thumbnail.png"
            }
            ],
                "sponsors": [
                {
                    "name": "Spire.io",
                    "logo": "sponsor-spire.png",
                    "url": "spire.io"
                },
                {
                    "name": "ioLA",
                    "logo": "iola.png",
                    "url": "iola.la"
                }
            ]
        },
        {
            "datetime": "Thursday, April 26, 2012",
            "host": {
                "address": "",
                "name": "Cross Campus",
                "mapIframeUrl": "",
                "mapUrl": "",
                "misc": "",
                "url": "crosscamp.us"
            },
            "speakers": [
            {
                "title": "Introducing Mojito",
                "name": "Gamaiel Zavala, Yahoo!",
                "image": "yahoo.png",
                "description": "Mojito is a sweet (and minty!) MVC application framework built on YUI 3 that enables agile development of Web applications. Gamaiel Zavala will be presenting an introduction to Mojito including set up, routing, controllers, models, addons, binders, and configuration. Gamaiel has been building Media sites at Yahoo! for 6 years and is currently working on Media's migration to Mojito."
            },
            {
                "title": "Seeing Sound with HTML5",
                "name": "David Guttman",
                "image": "davidguttman.png",
                "twitter": "davidguttman",
                "description": "Embrace JavaScript-induced synesthesia. Thanks to recent advances in web audio API technology, you can now see sound---in your browser. Thus, the time for in-browser music visualization is now! It's easier than ever before with EasyEars.js and David will show you how."
            },
            {
                "title": "Achieving Native Mobile App Performance using JavaScript",
                "name": "Michael Anthonya",
                "image": "flashtml5.jpg",
                "twitter": "flashtml5",
                "description": "JS for mobile development and getting the best performance out of CSS3 tweens."
            }
            ],
                "sponsors": [
                {
                    "name": "Spire.io",
                    "logo": "sponsor-spire.png",
                    "url": "spire.io"
                },
                {
                    "name": "Cross Campus",
                    "logo": "crosscampus.png",
                    "url": "crosscamp.us"
                }
            ]
        },
        {
            "datetime": "Thursday, March 29, 2012",
            "host": {
                "address": "",
                "name": "CityGrid Media",
                "mapIframeUrl": "",
                "mapUrl": "",
                "misc": "",
                "url": "citygridmedia.com"
            },
            "speakers": [
            {
                "title": "Breaking up big node.js apps into lots of tiny services",
                "name": "James Haliday",
                "image": "substack.jpg",
                "twitter": "substack",
                "description": "Splitting up your architecture into tiny processes that talk to each other over the network is useful for many of the same reasons that unix utilities are useful: they can focus on doing one thing well and it's trivial to glue a bunch of tiny processes together to serve some more complicated end goal. It can be difficult to write and deploy applications this way, but I've written some libraries such as dnode, upnode, seaport, and fleet to make this much easier to manage. In this talk I'll show how you can glue tiny processes together and split bigger ones up with these tools."
            },
            {
                "title": "An Introduction to WebGL and three.js",
                "name": "Travis Glines",
                "image": "travisglines.jpeg",
                "twitter": "travisglines",
                "description": "I had recently been working a lot with WebGL and three.js and will give a simple primer on what WebGL is, using three.js and how to make something neat."
            },
            {
                "title": "Creating Thumbnails from Movies Using JS and HTML5",
                "name": "James Baca",
                "image": "desertjim.jpg",
                "twitter": "desertjim",
                "description": "No description given."
            },
            {
                "title": "Streamlining Client Side JS Development",
                "name": "David Valdman",
                "image": "dmvaldman.jpg",
                "twitter": "dmvaldman",
                "description": "No description given."
            }
            ],
                "sponsors": [
                {
                    "name": "CityGrid",
                    "logo": "citygrid.png",
                    "url": "http://www.citygridmedia.com/"
                }
            ]
        }
    ]
}
